app/controllers/admin/assets_controller.rb

SELECT "assets".* FROM "assets"
---
  def index
    @assets = Asset.all

SELECT  "assets".* FROM "assets"  WHERE "assets"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @asset = Asset.find(params[:id])

SELECT  "assets".* FROM "assets"  WHERE "assets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @asset = Asset.find(params[:id])

INSERT INTO "assets" ("created_at", "document_content_type", "document_file_name", "document_file_size", "document_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @asset = Asset.new(params.require(:asset).permit!)
    flash[:notice] = 'Asset was successfully created.' if @asset.save

SELECT  "assets".* FROM "assets"  WHERE "assets"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "assets" SET "document_file_name" = ?, "document_file_size" = ?, "document_updated_at" = ?, "updated_at" = ? WHERE "assets"."id" = 2  [["document_file_name", "A-MALDIÇÃO-DO-MAS-E-MAIS.png"], ["document_file_size", 66834], ["document_updated_at", "2014-10-28 09:43:29.932632"], ["updated_at", "2014-10-28 09:43:30.792151"]]
---
  def update
    @asset = Asset.find(params[:id])
    flash[:notice] = 'Asset was successfully updated.' if @asset.update_attributes(params.require(:asset).permit!)

SELECT  "assets".* FROM "assets"  WHERE "assets"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "assets" WHERE "assets"."id" = ?  [["id", 1]]
---
  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy