app/controllers/admin/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-30 16:23:46.420888"], ["name", "teste 1"], ["updated_at", "2014-09-30 16:23:46.420888"]]
---
  def create
    @category = Category.new(params.require(:category).permit!)

    flash[:notice] = 'Category was successfully created.' if @category.save

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = 2  [["name", "teste 231"], ["updated_at", "2014-09-30 10:06:50.912123"]]
---
  def update
    @category = Category.find(params[:id])
    flash[:notice] = 'Category was successfully updated.' if @category.update_attributes(params.require(:category).permit!)