app/controllers/admin/posts_controller.rb

  def create
    @post = Post.new(params.require(:post).permit!)

    #@post = Post.new(params[:post])
    flash[:notice] = 'Post was successfully created.' if @post.save
---
INSERT INTO "posts" ("author_id", "body", "created_at", "draft", "excerpt", "published_at", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    params[:post][:category_ids] ||= []

    @post = Post.find(params[:id])
    flash[:notice] = 'Post was successfully updated.' if @post.update_attributes(params.require(:post).permit!)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "body" = ?, "draft" = ?, "excerpt" = ?, "permalink" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 6  [["body", "Opa"], ["draft", "t"], ["excerpt", "Opa"], ["permalink", "hgf"], ["title", "Opa"], ["updated_at", "2014-09-30 10:15:45.749129"]]

	def load_resources
		@categories = Category.all
		@authors = User.all
    @assets = Asset.order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "users".* FROM "users"
SELECT "assets".* FROM "assets"   ORDER BY created_at DESC