app/views/admin/posts/_form.html.erb

SELECT  1 AS one FROM "categories" INNER JOIN "categories_posts" ON "categories"."id" = "categories_posts"."category_id" WHERE "categories_posts"."post_id" = ? AND "categories"."id" = 1 LIMIT 1  [["post_id", 7]]
SELECT "categories".* FROM "categories"
---
        <%- @categories.each do |c| -%>
          <li><%= check_box_tag "post[category_ids][]", c.id, @post.categories.include?(c) %> <%= c.name %></li>