app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-09-23 17:38:16.447961"], ["name", "teste 2"], ["updated_at", "2014-09-23 17:38:16.447961"]]
---
  def create
    @category = Category.new(params.require(:category).permit!)

    respond_to do |format|
      if @category.save

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = 2  [["name", "teste 23"], ["updated_at", "2014-09-23 17:39:13.830941"]]
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params.require(:category).permit!)