app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    #@comment = @post.comments.build(params[:comment])
	@comment = @post.comments.create(params[:comment].permit!)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("author", "body", "created_at", "email", "post_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)