app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  WHERE (title LIKE '%primeiro%' OR body LIKE '%primeiro%') AND (draft = 'f' AND published_at = '2014-10-15 09:39:17.618111')
SELECT "posts".* FROM "posts" INNER JOIN "categories_posts" ON "posts"."id" = "categories_posts"."post_id" WHERE "categories_posts"."category_id" = ? AND (draft = 'f' AND published_at = '2014-10-15 09:55:33.633932')  [["category_id", 1]]
---
  def index
    @posts = Post.all
    @posts = @posts.search(params[:search]) if params[:search].present?
    @posts = @category.posts if @category.present?

SELECT  "posts".* FROM "posts"  WHERE (draft = 'f' AND published_at < '2014-10-15 10:20:46.357988') AND "posts"."id" = ? LIMIT 1  [["id", 11]]
---
  def show
    @post = Post.published.find(params[:id])

SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
---
  def load_categories
    @categories = Category.all
    @category = Category.find(params[:category_id]) if params[:category_id]